21-rails-validations/taco-tracker/app/views/tacos/_taco_form.html.erb


        Restaurant.all, # choose from all restaurants
---
SELECT "restaurants".* FROM "restaurants"


    <%= f.collection_select :restaurant_id, Restaurant.all, :id, :name %>
---
SELECT "restaurants".* FROM "restaurants"