17-rails-edit-update/taco-tracker/app/controllers/tacos_controller.rb

    def index
        if params[:veggie] == "true"
            @page_title = "Vegetarian Tacos"
            @tacos = Taco.veggie
        elsif params[:veggie] == "false"
            @page_title = "Meat Tacos"
            @tacos = Taco.meat
        else
            @page_title = "Taco Index Page"
            @tacos = Taco.all
---
SELECT "tacos".* FROM "tacos"

    def show
        taco_id = params[:id]

        @taco = Taco.find(taco_id)
---
SELECT "tacos".* FROM "tacos" WHERE "tacos"."id" = ? LIMIT ?  [["id", 37], ["LIMIT", 1]]

    def create
        new_taco = Taco.create(taco_params)
---
INSERT INTO "tacos" ("name", "vegetarian", "price", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Hipster Mustache Taco"], ["vegetarian", 1], ["price", 3.0], ["created_at", "2020-10-30 14:58:46.139296"], ["updated_at", "2020-10-30 14:58:46.139296"]]

    def edit
        @taco = Taco.find(params[:id])
---
SELECT "tacos".* FROM "tacos" WHERE "tacos"."id" = ? LIMIT ?  [["id", 49], ["LIMIT", 1]]

    def update
        @taco = Taco.find(params[:id])
        @taco.update(taco_params)
---
SELECT "tacos".* FROM "tacos" WHERE "tacos"."id" = ? LIMIT ?  [["id", 49], ["LIMIT", 1]]
UPDATE "tacos" SET "name" = ?, "updated_at" = ? WHERE "tacos"."id" = ?  [["name", "Mediocre Taco"], ["updated_at", "2020-10-30 15:18:03.248290"], ["id", 49]]