21-rails-validations/taco-tracker/app/controllers/restaurants_controller.rb

INSERT INTO "restaurants" ("name", "city", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Yummy Tacos"], ["city", "asdf"], ["created_at", "2020-11-03 14:52:57.275372"], ["updated_at", "2020-11-03 14:52:57.275372"]]
---
  def create
    # process the form
    r = Restaurant.create(restaurant_params)