24-Rails-testing/app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "cover_url", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "CRUD WebAPP"], ["cover_url", "https://miro.medium.com/max/768/0*-pZLqv--GRjtIQ2n.png"], ["created_at", "2020-11-10 16:56:25.502670"], ["updated_at", "2020-11-10 16:56:25.502670"]]
---
  def create
    @post = Post.new(post_params)

    if @post.save

UPDATE "posts" SET "title" = ?, "cover_url" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["title", "test"], ["cover_url", "none"], ["updated_at", "2020-11-10 17:48:54.357405"], ["id", 980190962]]
---
  def update
    if @post.update(post_params)