19-rails-associations/taco-tracker/app/controllers/tacos_controller.rb

SELECT "tacos".* FROM "tacos"
---
    def index
        if params[:veggie] == "true"
            @page_title = "Vegetarian Tacos"
            @tacos = Taco.veggie
        elsif params[:veggie] == "false"
            @page_title = "Meat Tacos"
            @tacos = Taco.meat
        else
            @page_title = "Taco Index Page"
            @tacos = Taco.all

SELECT "tacos".* FROM "tacos" WHERE "tacos"."id" = ? LIMIT ?  [["id", 37], ["LIMIT", 1]]
---
    def show
        taco_id = params[:id]

        @taco = Taco.find(taco_id)

SELECT "tacos".* FROM "tacos" WHERE "tacos"."id" = ? LIMIT ?  [["id", 31], ["LIMIT", 1]]
UPDATE "tacos" SET "vegetarian" = ?, "updated_at" = ? WHERE "tacos"."id" = ?  [["vegetarian", 0], ["updated_at", "2020-10-30 18:46:14.027651"], ["id", 34]]
---
    def meat_is_great
        @taco = Taco.find(params[:id])
        @taco.vegetarian = !@taco.vegetarian
        @taco.save

INSERT INTO "tacos" ("name", "vegetarian", "price", "created_at", "updated_at", "restaurant_id") VALUES (?, ?, ?, ?, ?, ?)  [["name", "This will work"], ["vegetarian", 1], ["price", 5.0], ["created_at", "2020-11-02 16:45:30.971025"], ["updated_at", "2020-11-02 16:45:30.971025"], ["restaurant_id", 6]]
---
    def create
        new_taco = Taco.create(taco_params)

SELECT "tacos".* FROM "tacos" WHERE "tacos"."id" = ? LIMIT ?  [["id", 49], ["LIMIT", 1]]
---
    def edit
        @taco = Taco.find(params[:id])

SELECT "tacos".* FROM "tacos" WHERE "tacos"."id" = ? LIMIT ?  [["id", 21], ["LIMIT", 1]]
UPDATE "tacos" SET "name" = ?, "updated_at" = ? WHERE "tacos"."id" = ?  [["name", "Mediocre Taco"], ["updated_at", "2020-10-30 15:18:03.248290"], ["id", 49]]
---
    def update
        @taco = Taco.find(params[:id])
        @taco.update(taco_params)

SELECT "tacos".* FROM "tacos" WHERE "tacos"."id" = ? LIMIT ?  [["id", 27], ["LIMIT", 1]]
DELETE FROM "tacos" WHERE "tacos"."id" = ?  [["id", 21]]
---
    def destroy
        dead_taco = Taco.find(params[:id])
        dead_taco.delete