16-rails-create-new/taco-tracker/app/controllers/tacos_controller.rb

SELECT "tacos".* FROM "tacos"
---
    def index
        if params[:veggie] == "true"
            @page_title = "Vegetarian Tacos"
            @tacos = Taco.veggie
        elsif params[:veggie] == "false"
            @page_title = "Meat Tacos"
            @tacos = Taco.meat
        else
            @page_title = "Taco Index Page"
            @tacos = Taco.all

SELECT "tacos".* FROM "tacos" WHERE "tacos"."id" = ? LIMIT ?  [["id", 37], ["LIMIT", 1]]
---
    def show
        taco_id = params[:id]

        @taco = Taco.find(taco_id)

INSERT INTO "tacos" ("name", "vegetarian", "price", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Bacon Taco"], ["vegetarian", 0], ["price", 10.0], ["created_at", "2020-10-28 17:02:46.658823"], ["updated_at", "2020-10-28 17:02:46.658823"]]
---
    def create
        new_taco_name = params[:name]
        new_taco_price = params[:price]
        new_taco_vegetarian = params[:vegetarian]
        new_taco = Taco.create(name: new_taco_name,
                               price: new_taco_price,
                               vegetarian: new_taco_vegetarian)