20-rails-partials/taco-tracker/app/views/tacos/_taco_form.html.erb

SELECT "restaurants".* FROM "restaurants"
---

        Restaurant.all, # choose from all restaurants

SELECT "restaurants".* FROM "restaurants"
---

    <%= f.collection_select :restaurant_id, Restaurant.all, :id, :name %>