19-rails-associations/taco-tracker/app/views/tacos/new.html.erb

SELECT "restaurants".* FROM "restaurants"
---

    <%= f.collection_select :restaurant_id, Restaurant.all, :id, :name %>