23-Rails-auth/app/controllers/users_controller.rb

    def create
        # byebug
        @user = User.new(user_params)

        # if @user.valid?
        if @user.save
---
INSERT INTO "users" ("username", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?)