21-rails-validations/taco-tracker/app/views/restaurants/new.html.erb


    <%= f.collection_check_boxes :taco_ids, Taco.all, :id, :name do |b| %>
---
SELECT "tacos".* FROM "tacos"