20-rails-partials/taco-tracker/app/views/restaurants/show.html.erb

<ul>
    <% @restaurant.tacos.each do |taco| %>
---
SELECT "tacos".* FROM "tacos" WHERE "tacos"."restaurant_id" = ?  [["restaurant_id", 9]]